# day17 > 2_한글_단어_분석.py
import json
import re

import matplotlib
from konlpy.tag import Okt
from collections import Counter
import matplotlib.pyplot as plt
from matplotlib import font_manager
from wordcloud import WordCloud

# 자료 준비 : etnews.kr_facebook_2016-01-01_2018-08-01_4차 산업혁명.json

# 1. 데이터 준비
    # 1 - 1. 파일 읽기
file = open("etnews.kr_facebook_2016-01-01_2018-08-01_4차 산업혁명.json", "r", encoding="utf-8")
file_data = file.read()

# json.loads() json 형식 -> py 형식, json.dumps() py 형식 -> json 형식
json_file_data = json.loads(file_data)
# print(json_file_data)

    # 1 - 2. 분석할 내용 추출
message = ""
for item in json_file_data :
    # 만약에 item(요소) 내 "message" 라는 key 가 존재하면
    if "message" in item.keys() :
        # print(item)
        # 전처리 (정규표현식)
            # 분석할 문장 내 정규 표현식을 이용해서 특수 문자를 제거하고 공백으로 치환
        message = message + re.sub(r"[^\w]", " ", item["message"])
        # print(message)
# print(message)

    # 1 - 3. 품사 태깅 : 명사 추출
    # 품사 태깅 객체 생성
okt = Okt()

    # 품사(명사) 태깅하기
nouns = okt.nouns(message)

# print(nouns)
"""
['스파크', '포럼', '미래', '시대', '조직', '변화', '시작', '스파크', '포럼', '현', '사회', '사회', '문제', '및', '이슈', '제기',
 '그', '이슈', '혁신', '해결', '소셜', '이노', '베이', '터', '발굴', '지원', '우리', '사회', '변화', '확산', '위해', '도전', 
 '만남', '자리', '스파크', '포럼', '차', '산업혁명', '시대', '기업', '조직', '직문', '조직', '변화', '실험', '사례', '통해', 
 '미래', '시대', '조직', '방향', '생각', '로봇', '차', '산업혁명', '주요', '성장', '동력', '국내', '로봇', '기업', '재', '평가', 
 '분석', '차', '산업혁명', '시대', '금융', '산업', '전반', '점검', '공통', '간판', '공약', '차', '산업혁명', '선도', '도시', '구현', 
 '과', '가상', '화폐', '블록', '체인', '기술', '활용', '등', '이번', '과정', '차', '산업혁명', '핵심', '기술', '대한', '통찰', 
 '알파', '통해', '우리', '일상', '로봇', '빅데이터', '산업', '흐름', '인공', '지능', '최고', '위', '과정', '산학', '최고', '전문가',
 '차', '산업혁명', '모든', '기술', '서비스', '산업혁명', '나라', '영국', '차', '산업혁명', '한국', '영국', '경험', '지혜', '미래', 
 '비즈니스', '포럼', '개최', '전자신문', '라이브', '직업', '위', '차', '산업혁명', '시대', '경쟁력', '확보', '일자리', '창', '해법', 
 '직업', '산업', '진흥', '이', '자신', '역량', '노력', '모두', '제', '직업', '위', '를', '진행', '이번', '전자신문', '라이브', 
 '서울', '대치동', '직업', '교육', '센터', '강', '만구', '직업', '교육', '팀', '지윤', '직업', '리서치', '팀', '수석', '윤석', 
 '테스트', '웍스', '대표', '등', '제', '직업', '위', '최신', '직업', '트렌드', '시간', '마련', '시청', '전자신문', '전자신문', 
 '터', '전자신문', '라이브', '소셜', '방송', '현장', '라이브', '손', '보련', '직업', '위', '산업', '진흥', '직업', '서울', '강', 
 '만구', '지윤', '윤석', '테스트', '웍스', '소프트웨어', '테스', '터', '소프트웨어', '테스', '터', '혹시', '우리나라', '차', 
 '산업혁명', '시대', '일자리', '전략', '강추', '차', '산업혁명', '대응', '가장', '강점', '분야', '세대', '이동통신', '산업', 
 '생태계', '조성', '노력', '강조', '중앙', '부처', '공무원', '차', '산업혁명', '관련', '가장', '대응', '기술', '과제', '로', 
 '빅데이터', '활용', '꼽', '전자신문', '라이브', '직', '격인', '터뷰', '산업', '진흥', '주형', '철', '대표이사', '최근', '급', 
 '공공기관', '차', '산업혁명', '국내', '중소기업', '경쟁력', '일자리', '창', '위해', '노력', '이번', '전자신문', '라이브', '중소기업', 
 '활성화', '일자리', '창', '공공기관', '중', '대표', '사례', '산업', '진흥', '주형', '철', '대표이사', '모시', '이야기', '시간', 
 '진행', '전자신문', '전자신문', '산업', '진흥', '주형', '철', '렬', '차', '산업혁명', '대응', '일자리', '창', '문재인', '정부', 
 '주요', '국정', '과제', '우선', '순위', '지적', '통합', '개혁', '행보', '움직임', '차', '산업혁명', '등', '성장동력', '창', 
 '발짝', '못', '평', '미래창조과학부', '주최', '전자', '신문사', '한국', '경제', '신문', '국정', '보통신', '진흥', '협회', 
 '주관', '서울', '강남구', '삼성동', '코엑스', '개막', '월드', '쇼', '은', '차', '산업혁명', '더', '이상', '개념', '현실', 
 '음', '입증', '전자신문', '라이브', '예고', '이번', '전자신문', '차', '산업혁명', '과학기술', '영상', '컨퍼런스', '생중계', 
 '광운대', '학교', '이승현', '교수', '모시', '진행', '이번', '행사', '기술', '몰힙형', '미디어', '대해', '설명', '이번', '행사', 
 '전자신문', '가상현실', '스튜디오', '솔루션', '제작', '다림', '비젼', '중견', '기업', '차', '산업', '정보', '채널', '를', '통해', 
 '진행', '전세계', '차', '산업', '혁명', '현장', '소식', '정보', '컨퍼런스', '강연', '정보', '기술', '원격', '방송', '기술', 
 '중심', '시간', '거리', '초월', '실시간', '기술', '방송', '서비스', '강의', '전자신문', '페이스북', '통해', '시청', '수', '관심', 
 '대선', '국면', '법안', '시급', '때문', '차', '산업혁명', '대비', '법제', '개편', '논의', '불', '전망', '차', '산업혁명', '시대', 
 '대비', '차', '산업혁명', '의', '이해', '폐막', '다보스', '포럼', '차', '산업혁명', '기대', '우려', '교차', '구글', '애플', 
 '페이스북', '삼성', '전자', '전자', '앞', '차', '산업혁명', '흐름']
"""

# 2. 데이터 분석
    # 2 - 1. 단어 빈도 분석
words_counts = Counter(nouns)

# print(words_counts)
"""
Counter({'차': 23, '산업혁명': 22, '전자신문': 13, '산업': 10, '직업': 10, '기술': 8, '시대': 7, '라이브': 7, '이번': 6, 
'진흥': 6, '포럼': 5, '위': 5, '일자리': 5, '창': 5, '조직': 4, '터': 4, '통해': 4, '진행': 4, '스파크': 3, '미래': 3, 
'변화': 3, '사회': 3, '기업': 3, '로봇': 3, '등': 3, '노력': 3, '서울': 3, '시간': 3, '방송': 3, '대응': 3, '주형': 3, '철': 3, 
'전자': 3, '정보': 3, '이슈': 2, '소셜': 2, '우리': 2, '위해': 2, '사례': 2, '주요': 2, '국내': 2, '활용': 2, '과정': 2, 
'빅데이터': 2, '흐름': 2, '최고': 2, '서비스': 2, '영국': 2, '한국': 2, '경쟁력': 2, '제': 2, '를': 2, '교육': 2, '강': 2, 
'만구': 2, '팀': 2, '지윤': 2, '윤석': 2, '테스트': 2, '웍스': 2, '대표': 2, '시청': 2, '현장': 2, '소프트웨어': 2, '테스': 2, 
'가장': 2, '과제': 2, '대표이사': 2, '공공기관': 2, '중소기업': 2, '모시': 2, '국정': 2, '컨퍼런스': 2, '행사': 2, '페이스북': 2, 
'대비': 2, '시작': 1, '현': 1, '문제': 1, '및': 1, '제기': 1, '그': 1, '혁신': 1, '해결': 1, '이노': 1, '베이': 1, '발굴': 1, 
'지원': 1, '확산': 1, '도전': 1, '만남': 1, '자리': 1, '직문': 1, '실험': 1, '방향': 1, '생각': 1, '성장': 1, '동력': 1, 
'재': 1, '평가': 1, '분석': 1, '금융': 1, '전반': 1, '점검': 1, '공통': 1, '간판': 1, '공약': 1, '선도': 1, '도시': 1, 
'구현': 1, '과': 1, '가상': 1, '화폐': 1, '블록': 1, '체인': 1, '핵심': 1, '대한': 1, '통찰': 1, '알파': 1, '일상': 1, 
'인공': 1, '지능': 1, '산학': 1, '전문가': 1, '모든': 1, '나라': 1, '경험': 1, '지혜': 1, '비즈니스': 1, '개최': 1, 
'확보': 1, '해법': 1, '이': 1, '자신': 1, '역량': 1, '모두': 1, '대치동': 1, '센터': 1, '리서치': 1, '수석': 1, '최신': 1, 
'트렌드': 1, '마련': 1, '손': 1, '보련': 1, '혹시': 1, '우리나라': 1, '전략': 1, '강추': 1, '강점': 1, '분야': 1, '세대': 1, 
'이동통신': 1, '생태계': 1, '조성': 1, '강조': 1, '중앙': 1, '부처': 1, '공무원': 1, '관련': 1, '로': 1, '꼽': 1, '직': 1, 
'격인': 1, '터뷰': 1, '최근': 1, '급': 1, '활성화': 1, '중': 1, '이야기': 1, '렬': 1, '문재인': 1, '정부': 1, '우선': 1, 
'순위': 1, '지적': 1, '통합': 1, '개혁': 1, '행보': 1, '움직임': 1, '성장동력': 1, '발짝': 1, '못': 1, '평': 1, 
'미래창조과학부': 1, '주최': 1, '신문사': 1, '경제': 1, '신문': 1, '보통신': 1, '협회': 1, '주관': 1, '강남구': 1, '삼성동': 1, 
'코엑스': 1, '개막': 1, '월드': 1, '쇼': 1, '은': 1, '더': 1, '이상': 1, '개념': 1, '현실': 1, '음': 1, '입증': 1, '예고': 1, 
'과학기술': 1, '영상': 1, '생중계': 1, '광운대': 1, '학교': 1, '이승현': 1, '교수': 1, '몰힙형': 1, '미디어': 1, '대해': 1, 
'설명': 1, '가상현실': 1, '스튜디오': 1, '솔루션': 1, '제작': 1, '다림': 1, '비젼': 1, '중견': 1, '채널': 1, '전세계': 1, 
'혁명': 1, '소식': 1, '강연': 1, '원격': 1, '중심': 1, '거리': 1, '초월': 1, '실시간': 1, '강의': 1, '수': 1, '관심': 1, 
'대선': 1, '국면': 1, '법안': 1, '시급': 1, '때문': 1, '법제': 1, '개편': 1, '논의': 1, '불': 1, '전망': 1, '의': 1, 
'이해': 1, '폐막': 1, '다보스': 1, '기대': 1, '우려': 1, '교차': 1, '구글': 1, '애플': 1, '삼성': 1, '앞': 1})
"""

# 2 - 2. 단어 빈도수 딕셔너리화
words_counts_dic = {}
# words_counts_dic = {} vs words_counts_dic = dict()
for t, c in words_counts.most_common(80) :
    if len(t) > 1 : # 단어의 길이가 1글자인 단어는 제외
        words_counts_dic[t] = c
        # { "단어" : 빈도수 }

# print(words_counts_dic)
"""
{'산업혁명': 22, '전자신문': 13, '산업': 10, '직업': 10, '기술': 8, '시대': 7, '라이브': 7, '이번': 6, '진흥': 6, '포럼': 5, 
'일자리': 5, '조직': 4, '통해': 4, '진행': 4, '스파크': 3, '미래': 3, '변화': 3, '사회': 3, '기업': 3, '로봇': 3, '노력': 3, 
'서울': 3, '시간': 3, '방송': 3, '대응': 3, '주형': 3, '전자': 3, '정보': 3, '이슈': 2, '소셜': 2, '우리': 2, '위해': 2, 
'사례': 2, '주요': 2, '국내': 2, '활용': 2, '과정': 2, '빅데이터': 2, '흐름': 2, '최고': 2, '서비스': 2, '영국': 2, '한국': 2, 
'경쟁력': 2, '교육': 2, '만구': 2, '지윤': 2, '윤석': 2, '테스트': 2, '웍스': 2, '대표': 2, '시청': 2, '현장': 2, '소프트웨어': 2, 
'테스': 2, '가장': 2, '과제': 2, '대표이사': 2, '공공기관': 2, '중소기업': 2, '모시': 2, '국정': 2, '컨퍼런스': 2, '행사': 2, 
'페이스북': 2, '대비': 2, '시작': 1, '문제': 1}
"""

# 3. 시각화
    # 3 - 0. matplotlib 에서 한글화
"""
    # 시스템(컴퓨터) 폰트의 경로가 명확하지 않을 때
    # (1) 폰트 경로
        # 윈도우 기준의 폰트가 설치된 경로 : c:/windows/fonts/폰트명

font_path = "c:/windows/fonts/malgun.ttf"

    # (2) 폰트 설정 객체를 이용한 폰트 설정
font_kor = font_manager.FontProperties(frame = font_path).get_Name()

    # (3) 차트에 적용
matplotlib.rc("font", family = font_kor)
"""
font_path = "c:/windows/fonts/malgun.ttf"
matplotlib.rc("font", family = "Malgun Gothic")

    # 3 - 1. plt.bar(x축 값, y축 값)
plt.bar(words_counts_dic.keys(), words_counts_dic.values())
    # 3 - 2. x축 label 기울기
plt.xticks(rotation = 75)

plt.show()

# 4. 시각화 2 -> 워드 클라우드
    # .generate_from_frequencies() : 단어외 빈도수를 딕셔너리 형식으로 받아서 시각화함
wc = WordCloud(font_path, background_color="ivory").generate_from_frequencies(words_counts_dic)
plt.imshow(wc)
plt.show()